9/data/attachments/1da018cbb7840fef.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_a2f52e87-e0b5-4f03-88b9-e00689416176</nif:username>
            <nif:friendToBeAdded>Zachary_easy_Actions_42272_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>